Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.GetApplicableDemandFactor(System.Double)
This method will return the applicable demand factor for the specified number
of devices or load.
numberOrLoad:
The number of devices or load for which the demand factor should be looked up.
Returns:
The applicable demand factor.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.GetValuesCount
Returns the number of values in the set.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.GetValues
Provides access to the value set stored with this demand factor definition
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.SetValues(System.Collections.Generic.ICollection{Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue})
Sets the value set to the demand factor definition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.RemoveValue(Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue)
Removes a value to the value set for this demand factor definition
dfValue:
Value to remove from the set
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.AddValue(Autodesk.Revit.DB.Electrical.ElectricalDemandFactorValue)
Adds a value to the value set for this demand factor definition
dfValue:
Value to add to the set
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.ClearValues
Clears all the values stored for this demand factor definition.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.Create(Autodesk.Revit.DB.Document,System.String)
Creates a new instance of a demand factor definition.
ADoc:
The document where the element will be created and added.
strName:
The name of the electrical demand factor definition to be created.
Returns:
The newly created demand factor definition element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.IncludeAdditionalLoad
Should the additional load (if set) be included in demand load calculations.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.RuleType
The rule type for this demand factor definition.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.AdditionalLoad
Additional load to be included during demand load calculation.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.#ctor
Constructs a new ElectricalDemandFactorDefinition with default settings.
Since:
2011

Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition
The ElectricalDemandFactorDef class represents a serialized version of an instance of
demand factor definition.  It has a name, rule type, and values for the rules that are serialized.
Since:
2011